rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "classdetails".* FROM "classdetails" WHERE "classdetails"."number" = ? LIMIT 1  [["number", "COMS W1004"]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
    @classdetail = Classdetail.find_by(number: @movie.course_num)