app/views/courses/prevcoursesform.html.erb

SELECT "courses".* FROM "courses"
---
           <%= label_tag "show_course[#{course.course_num}]", course.course_num, class: 'form-check-label' %>
           <%= check_box_tag "show_course[#{course.course_num}]", "0",  @courses.include?(course), class: 'form-check-input', id: "showcourses_#{course.course_num}"%>