app/views/courses/show.html.erb

<%= button_to 'I am interested in this course!', course_likes_path(@course), method: :post %>
<p><%= @course.likes.count %> <%= (@course.likes.count) == 1 ? ' student interested in this course' : ' students interested in this course'%></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."course_id" = $1  [["course_id", 1]]