app/views/courses/updatedcourses.html.erb

SELECT "courses".* FROM "courses"
---
          <%= label_tag "addCart[#{course.course_num}]", "", class: 'form-check-label' %>
          <%= check_box_tag "addCart[#{course.course_num}]", "1", @addCart.include?(course.course_num), class: 'form-check-input', id: "addCart[#{course.course_num}]"%>