app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "jp4024@columbia.edu"]]
---
  def login
    username = params[:username]
    password = params[:password]
    @user = User.find_by(username: username)