app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
---
    def add_faq
        id = params[:id]
        question = params[:inputQuestion]
        @course = Course.find(id)