app/controllers/courses_controller.rb

    def show
        id = params[:id] # retrieve movie ID from URI route
        @course = Course.find(id) # look up course by unique ID
        @coursedetail = Coursedetails.find_by(number: @course.course_num)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "coursedetails".* FROM "coursedetails" WHERE "coursedetails"."number" = ? LIMIT 1  [["number", "COMS W1004"]]

    def prevcoursesform
 	# source: http://railscasts.com/episodes/37-simple-search-form?autoplay=true
	@courses = Course.all
---
SELECT "courses".* FROM "courses"

    def searchresults
         if params[:search]
                @courses = Course.where("course_num LIKE ?", "%#{params[:search]}%")
---
SELECT "courses".* FROM "courses" WHERE (course_num LIKE '%COMS 1004%')

    def updatedcourses
 	@requirements_to_show = Course.all_requirements
	@all_departments = Course.all_departments
 	@all_requirements = Course.all_requirements
 	@courses = []
	Course.all.each do |each_course|
---
SELECT "courses".* FROM "courses"

    def index
        puts "params are ... #{params}"
        @all_departments = Course.all_departments
        @all_requirements = Course.all_requirements

        if params.has_key?(:requirements)
            @query_requirements = params[:requirements]
        else
            @query_requirements = Hash[@all_requirements.map {|x| [x, 1]}]
        end

        if params.has_key?(:department)
            @department = (params[:department])
        else
            @department = "All"
        end

        @courses = Course.filter_by_params(@department, @query_requirements.keys)
        @requirements_to_show = Course.requirements_to_show
        @department_to_show = Course.department_to_show
        if !(params.has_key?(:requirements))
            @requirements_to_show = []
        end
        @addCart = []
        in_cart = Cart.where({user_id: get_user_id_from_session})
---
SELECT "courses".* FROM "courses" WHERE "courses"."requirement" IN ('Major Core', 'General Technical Requirement', 'General Technical Elective', 'Track Course')
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", "1"]]

    def add_faq
        id = params[:id]
        question = params[:inputQuestion]
        course_num = params[:inputCourse]
        @course = Course.find_by(course_num: course_num)
        course_faq = CourseFaq.create(course_number: course_num, question: question)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."course_num" = $1 LIMIT 1  [["course_num", "C1"]]
INSERT INTO "course_faqs" ("course_number", "question", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_number", "C1"], ["question", "what are the pre-requistes for this course?"], ["created_at", "2021-04-03 16:40:55.165262"], ["updated_at", "2021-04-03 16:40:55.165262"]]

    def add_ans
        course_faq_ans = CourseFaqAn.create(question_number: params[:inputQuestionId], answer: params[:inputAnswer], course_number: params[:course_number])
        ans = CourseFaqAn.all
        @course = Course.find_by(course_num: params[:course_number])
---
INSERT INTO "course_faq_ans" ("question_number", "answer", "course_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_number", 1], ["answer", "testing FAQ-1: response"], ["course_number", "COMS W1004"], ["created_at", "2021-03-26 18:59:58.679577"], ["updated_at", "2021-03-26 18:59:58.679577"]]
SELECT  "courses".* FROM "courses" WHERE "courses"."course_num" = ? LIMIT 1  [["course_num", "COMS W1004"]]

     def add_to_cart
        @overlap = []
        @cartDetails = []
        user_id = get_user_id_from_session
        course_time_array = []
        if params[:addCart] != nil
            if params[:addCart].size < 7
                cart = params[:addCart]
                Cart.where(user_id: user_id).delete_all
                cart.each do |each_course|
                    course = Course.find_by(course_num: each_course[0])
                    Cart.create(user_id: user_id, course_number: course.course_num, course_name: course.course_name, course_time: course.course_time)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."course_num" = ? LIMIT 1  [["course_num", "COMS W1004"]]
INSERT INTO "carts" ("user_id", "course_number", "course_time") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", "1"], ["course_number", "C1"], ["course_time", "TR 1:10pm-2:25pm"]]