app/controllers/likes_controller.rb

INSERT INTO "likes" ("course_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["course_id", 5], ["created_at", "2021-04-11 20:22:18.083129"], ["updated_at", "2021-04-11 20:22:18.083129"]]
---
  def create
    if already_liked
	flash[:notice] = "Looks like you already indicated your interest!"
    else
        @course.likes.create(user_id: params[:username])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def find_course
    @course = Course.find(params[:course_id])