app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "classdetails".* FROM "classdetails" WHERE "classdetails"."number" = ? LIMIT 1  [["number", "COMS W1004"]]
---
    def show
        id = params[:id] # retrieve movie ID from URI route
        @movie = Movie.find(id) # look up movie by unique ID
        @classdetail = Classdetail.find_by(number: @movie.course_num)

SELECT "movies".* FROM "movies" WHERE "movies"."requirement" IN ('Major Core', 'General Technical Requirement', 'General Technical Elective', 'Track Course')
---
    def index
        @all_departments = Movie.all_departments
        @all_requirements = Movie.all_requirements

        if params.has_key?(:requirements)
            @query_requirements = params[:requirements]
        else
            @query_requirements = Hash[@all_requirements.map {|x| [x, 1]}]